Tekla.Structures.DirectManipulation.Model.PourBreakPreviewSelector.GetPreviewPolymeshMethod
A delegate for specifying the method in native dll imports to be called for getting a preview polymesh.
id:
The ID to be passed to the native call (the model object lying under the picked point(s) or the pour break being modified).
input:
Input data consisting of polyline points and extension direction.
output:
Output data as preview polymesh.
Returns:
True on success; false on failure.